# Group by

In [5]:
import pandas as pd

df = pd.DataFrame({"name":["a","b","c","d","a","a","a","b","b"],
                  "subject":[12,45,78,3,4,8,99,77,33],
                  "subject2":[45,61,12,45,78,12,32,66,23]})
df
df_group = df.groupby("name")
df_group

for x,y in df_group:
    print(x)
    print()
    print(y)

a

  name  subject  subject2
0    a       12        45
4    a        4        78
5    a        8        12
6    a       99        32
b

  name  subject  subject2
1    b       45        61
7    b       77        66
8    b       33        23
c

  name  subject  subject2
2    c       78        12
d

  name  subject  subject2
3    d        3        45

In [7]:
df_group.get_group("a")

  name  subject  subject2
0    a       12        45
4    a        4        78
5    a        8        12
6    a       99        32

In [8]:
df_group.get_group("d")

  name  subject  subject2
3    d        3        45

In [9]:
df_group.min()

      subject  subject2
name
a           4        12
b          33        23
c          78        12
d           3        45

In [10]:
df_group.max()

      subject  subject2
name
a          99        78
b          77        66
c          78        12
d           3        45

In [11]:
df_group.mean()

        subject  subject2
name
a     30.750000     41.75
b     51.666667     50.00
c     78.000000     12.00
d      3.000000     45.00

In [12]:
li = list(df_group)
li

[('a',
    name  subject  subject2
  0    a       12        45
  4    a        4        78
  5    a        8        12
  6    a       99        32),
 ('b',
    name  subject  subject2
  1    b       45        61
  7    b       77        66
  8    b       33        23),
 ('c',
    name  subject  subject2
  2    c       78        12),
 ('d',
    name  subject  subject2
  3    d        3        45)]